Repository: LuchoPonceC/cpp-project-template
Catalog: locales/*.po
Languages: fr

source: Synopsis ======== Example command-line utility. Usage ===== cpp-project-template [options] Options ======= {1} Description =========== Displays its own version string.
fr: Carnet de bord ============== Utilitaire de ligne de commande de l’exemple. Utilisation =========== cpp-project-template [options] Options ======= {1} Description =========== Affiche sa propre chaîne de version.

source: Enable full debugging.
fr: Activer le débogage complet.

source: Print this help message.
fr: Produire le message d’aide

source: Silences all output.
fr: Silences toutes les sorties.

source: Enable verbosity.
fr: Activer verbosité.

source: Print the program's version number and exit.
fr: Imprimer la version de make API de et sortir.

source: Set logging level. Supported levels are: none, trace, debug, info, warn, error, and fatal.
fr: Réglez le niveau d’enregistrement. Niveaux de prises en charge sont : aucun, trace, debug, info, warn, error et fatal.

source: Error: {1}
fr: Erreur: {1}

source: unhandled exception: {1}
fr: exception non gérée: {1}

source: Hello!
fr: Salut!

source: cpp-project-template version is {1}
fr: cpp-project-template de version est {1}
